OpenFOAM-5/chapter8/coFlowFlame2D/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1e5;

boundaryField
{
    fuel
    {
        type            zeroGradient;
    }
    air
    {
        type            zeroGradient;
    }
    outlet
    {
        type            fixedValue;
        value           uniform 1e5;
    }
    axis
    {
        type            symmetryPlane;
    }
    wallUp
    {
        type            zeroGradient;
    }
    "(front-1|front-2)"
    {
        type            wedge;
    }
    "(back-1|back-2)"
    {
        type            wedge;
    }
}


// ************************************************************************* //
